# Handling missing values - na_values

In [1]:
import pandas as pd

In [2]:
df_na_nav = pd.read_csv("./datasets/df_na_nav.csv")

In [3]:
df_na_nav

       Name  Score         Grades
0      Paul   98.0  not available
1     Aaron    NaN             AB
2    Krista   99.0             AA
3  Veronica   87.0            NaN
4    Paxton   90.0             AC
5   Madison    NaN             BA
6    Aurora   82.0             BB

## Handling the wrong missing values from read

In [6]:
df_na_read = pd.read_csv("./datasets/df_na_nav.csv", na_values='not available')

In [7]:
df_na_read

       Name  Score Grades
0      Paul   98.0    NaN
1     Aaron    NaN     AB
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
5   Madison    NaN     BA
6    Aurora   82.0     BB

As you can see 'not available' is converted to NaN

If you want to replace multiple unknown missing values with NaN, just pass the values as a list like below

In [ ]:
# df_na_read = pd.read_csv("./datasets/df_na_nav.csv", na_values=['not available', 'wrong data', 'na values'])

## Handling missing values only in a particular column

pass the values as a dictionary with the key is the name of the column and the values are the name of the wrong values

In [8]:
df_na_dict = pd.read_csv("./datasets/df_na_nav.csv", na_values={'Grades' : 'not available'})

In [9]:
df_na_dict

       Name  Score Grades
0      Paul   98.0    NaN
1     Aaron    NaN     AB
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
5   Madison    NaN     BA
6    Aurora   82.0     BB